# -*- org-confirm-babel-evaluate: nil -*-
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:3
#+LANGUAGE: en-us
#+HTML_DOCTYPE: html5
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <style>blockquote p:last-child, div.figure p {margin: 0;}</style>
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,12pt]
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \renewcommand{\familydefault}{\sfdefault}
#+LATEX_HEADER: \usepackage{helvet}
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[document]{ragged2e}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{sectsty}
#+LATEX_HEADER: \titleformat*{\section}{\LARGE\bfseries}
#+LATEX_HEADER: \titleformat*{\subsection}{\Large\bfseries}
#+LATEX_HEADER: \titleformat*{\subsubsection}{\large\bfseries}
#+LATEX_HEADER: \titleformat*{\paragraph}{\large\bfseries}
#+LATEX_HEADER: \titleformat*{\subparagraph}{\large\bfseries}
#+LATEX_HEADER: \renewcommand{\baselinestretch}{1.2}
#+LATEX_HEADER: \definecolor{light_grey}{RGB}{51,51,51}
#+LATEX_HEADER: \definecolor{bright_grey}{RGB}{249,249,249}
#+LATEX_HEADER: \definecolor{python_blue}{RGB}{41,128,185}
#+LATEX_HEADER: \hypersetup{colorlinks=true, urlcolor=python_blue, linkcolor=python_blue, citecolor=red}
#+LATEX_HEADER: \tolerance=1
#+LATEX_HEADER: \emergencystretch=\maxdimen
#+LATEX_HEADER: \hyphenpenalty=10000
#+LATEX_HEADER: \hbadness=10000
#+LATEX_HEADER: \makeatletter
#+LATEX_HEADER: \makeatother
#+LATEX_HEADER: \lstset{
#+LATEX_HEADER:   xleftmargin=0.5cm,frame=tlbr,framesep=4pt,framerule=0pt,
#+LATEX_HEADER:   columns=fullflexible,
#+LATEX_HEADER:   backgroundcolor=\color{white},
#+LATEX_HEADER:   basicstyle=\footnotesize\ttfamily,
#+LATEX_HEADER:   breakatwhitespace=false,
#+LATEX_HEADER:   breaklines=true,
#+LATEX_HEADER:   frame=single,
#+LATEX_HEADER:   keepspaces=true,
#+LATEX_HEADER:   rulecolor=\color{black},
#+LATEX_HEADER:   showspaces=false,
#+LATEX_HEADER:   showstringspaces=false,
#+LATEX_HEADER:   showtabs=false,
#+LATEX_HEADER:   stepnumber=2,
#+LATEX_HEADER:   tabsize=2,
#+LATEX_HEADER: }
#+LATEX_HEADER: \DeclareUnicodeCharacter{202F}{ }
#+LATEX: \frenchspacing
#+LATEX: \raggedright
#+TITLE: Pipeline: retrieve TTE data
#+AUTHOR: Richard Zetterberg <richard.zetterberg@regionh.dk>
#+PROPERTY: header-args:R :session *R* :tangle yes :shebang "#!/usr/bin/env Rscript"

#+LATEX: \clearpage

#+BEGIN_SRC R :exports none :tangle no
devtools::load_all(".")
source("./tests/utils.R")
#+END_SRC

#+RESULTS:

This is a guide for using the pre-assembled pipeline that retrieves TTE (time-to-event)
data from the [[https://github.com/BioPsyk/ibp-registry][ibp-registry database]].

All code shown in this guide have been written to [[./retrieve-tte.R][this R file]], so that you don't have
to copy all code snippets manually.

This pipeline uses the R class ~TTERetriever~ that accepts:

- An output directory path
- An output prefix
- A set of arguments

Using those inputs, it generates an SQL query that it
executes in the [[https://github.com/BioPsyk/ibp-registry][ibp-registry database]] to produce the TTE data.

All output files are named using the provided output prefix and put inside the provided
output directory. A copy of the provided arguments are also put in the output directory
with the provided output prefix. By saving the arguments, the SQL query and the produced
TTE data in the same place, you have the ability to:

- Inspect exactly how the data was retrieved
- Make incremental changes and rerun the retrieval if something is wrong
- Compare different retrievals easily

* Getting started

We start by importing all the needed libraries:

#+BEGIN_SRC R :exports code :eval no
library(data.table)
library(dplyr)
library(dtplyr)
library(epimight)
#+END_SRC

After that we choose an output directory and provide our login credentials
of the database when creating an instance of the ~TTERetriever~ class:

#+BEGIN_SRC R :exports code
tte_retriever <- TTERetriever$new("./tmp", "localhost", "postgres", "devpass")
#+END_SRC

#+RESULTS:

We use the directory ~"./tmp"~ which is the directory that test outputs and
other temporary files are kept in this repository. Then we connect to a locally
running database with test data in it, which can be reached using the hostname
~localhost~. In that test database there is only one user, ~postgres~ that has
the hardcoded password ~devpass~.

After that you primarily use the function ~run~ of the ~TTERetriever~ instance.
That function takes the TTE arguments to use and the output prefix to use.
If we use the output prefix ~scz_millenials~ then the ~run~ function would
produce the following 3 files when executed:

- ~./tmp/scz_millenials.yaml~ (copy of arguments provided)
- ~./tmp/scz_millenials.sql~ (SQL query that was run)
- ~./tmp/scz_millenials.csv~ (TTE data that was produced)

These "TTE arguments" are what controls all the details of which samples to retrieve
and what diagnosis/extra information to include for each sample. You can think of
these arguments as a big questionnaire you have to fill in when requesting TTE data.
Most of the arguments are optional, there are only two arguments that are required:

- What disorder should be retrieved?
- What study end date should be used?

You can retrieve TTE data for multiple disorders at once, but you have to use at least
one disorder. When determining the failure status for each retrieved disorder, a
study end date have to be picked, so that we know when a sample has survived
the whole period that is being studied.

* Bare minimum

The first example is the bare minimum, only providing the arguments that are required.
In this case, we are going to retrieve the whole population, add diagnosis information
for schizophrenia and we are going to use the study period from first person registered
to ~2016-12-31~. Here's what the TTE arguments would look like for those choices:

#+BEGIN_SRC R :exports both :results output
tte_args <- list(
  samples = list(
    diagnosis_filters = list(
      scz = list(
        icd_codes_regexp = "^F20|^295"
      )
    )
  ),
  study_end_at = "2016-12-31"
)

paths <- tte_retriever$run("scz_genpop", tte_args)
#+END_SRC

#+RESULTS:

Here you can see that for ~samples~, we want to apply the ~diagnosis_filters~ which
contains a single disorder, that we have given the key ~scz~ to. That means that
all columns with diagnosis information for schizophrenia will use the prefix ~scz_~:

#+BEGIN_SRC R :exports both :results output
results <- read_csv(paths$data, show_col_types = FALSE, progress = FALSE) |>
  as.data.table()

print(results)
#+END_SRC

#+RESULTS:
#+begin_example
     person_id scz_failure_status scz_failure_at scz_failure_time
  1:         1                  1     2001-07-17         12.62697
  2:         2                  0     2016-12-31         34.06434
  3:         4                  1     2014-04-19         64.05749
  4:        10                  1     1995-08-14         26.16290
  5:        14                  0     2016-12-31         86.55989
 ---
136:       309                  0     2016-12-31        104.41615
137:       310                  1     2003-10-19         99.38125
138:       312                  0     2003-11-03         72.71184
139:       314                  0     1986-11-19         50.05339
140:       320                  0     2016-12-31         49.04860
#+end_example

Suppose we wanted to retrieve TTE data for two disorders, schizophrenia and
major depressive disorder. Now you'll see what you get the TTE information
for both disorders using the prefix ~scz_~ and ~mdd_~:

#+BEGIN_SRC R :exports both :results output
tte_args <- list(
  samples = list(
    diagnosis_filters = list(
      scz = list(
        icd_codes_regexp = "^F20|^295"
      ),
      mdd = list(
        icd_codes_regexp = "^F3[23]"
      )
    )
  ),
  study_end_at = "2016-12-31"
)

paths <- tte_retriever$run("scz_mdd_genpop", tte_args)

results <- read_csv(paths$data, show_col_types = FALSE, progress = FALSE) |>
  as.data.table()

print(results)
#+END_SRC

#+RESULTS:
#+begin_example
     person_id mdd_failure_status mdd_failure_at mdd_failure_time scz_failure_status
  1:         1                  0     2001-12-20         13.05407                  1
  2:         2                  0     2016-12-31         34.06434                  0
  3:         4                  0     2016-12-31         66.75975                  1
  4:        10                  0     2016-12-31         47.54552                  1
  5:        14                  0     2016-12-31         86.55989                  0
 ---
136:       309                  0     2016-12-31        104.41615                  0
137:       310                  0     2016-12-31        112.58316                  1
138:       312                  0     2003-11-03         72.71184                  0
139:       314                  0     1986-11-19         50.05339                  0
140:       320                  0     2016-12-31         49.04860                  0
     scz_failure_at scz_failure_time
  1:     2001-07-17         12.62697
  2:     2016-12-31         34.06434
  3:     2014-04-19         64.05749
  4:     1995-08-14         26.16290
  5:     2016-12-31         86.55989
 ---
136:     2016-12-31        104.41615
137:     2003-10-19         99.38125
138:     2003-11-03         72.71184
139:     1986-11-19         50.05339
140:     2016-12-31         49.04860
#+end_example

Right now, there is a limit on 10 disorders.

* Filtering samples

We have the ability to apply the following filters to the samples retrieved:

- ~born_at_min~ :: Earliest birth date allowed
- ~born_at_max~ :: Latest birth date allowed
- ~gender~ :: Specific gender allowed
- ~status~ :: Civil statuses allowed

If we, for example, wanted to retrieve only millenials, we could add the two arguments ~born_at_min~ and ~born_at_max~.
You specifiy these filters inside the ~individual_filters~ element inside the ~samples~ element:

#+BEGIN_SRC R :exports both :results output
tte_args <- list(
  samples = list(
    individual_filters = list(
      born_at_min = "1981-01-01",
      born_at_max = "1996-12-31"
    ),
    diagnosis_filters = list(
      scz = list(
        icd_codes_regexp = "^F20|^295"
      )
    )
  ),
  study_end_at = "2016-12-31"
)

paths <- tte_retriever$run("scz_millenials", tte_args)

results <- read_csv(paths$data, show_col_types = FALSE, progress = FALSE) |>
  as.data.table()

print(results)
#+END_SRC

#+RESULTS:
#+begin_example
    person_id scz_failure_status scz_failure_at scz_failure_time
 1:         1                  1     2001-07-17        12.626968
 2:         2                  0     2016-12-31        34.064339
 3:        24                  0     1999-07-24        16.818617
 4:        50                  1     1989-07-26         1.048597
 5:        56                  0     1994-01-21         9.325120
 6:        61                  0     2016-12-31        33.259411
 7:        65                  0     2008-10-13        17.752225
 8:        87                  0     2016-12-31        21.678303
 9:        88                  1     1990-08-19         4.049281
10:        92                  1     2016-07-08        26.861054
11:        94                  1     1997-10-30        13.360712
12:       106                  0     1999-07-11        12.065708
13:       109                  1     1988-10-25         2.179329
14:       120                  0     2016-12-31        23.707050
15:       121                  0     1994-09-18         2.565366
16:       153                  1     1994-06-26         6.551677
17:       164                  0     2016-12-31        20.536619
18:       191                  0     2016-12-31        20.490075
19:       199                  0     2005-12-21        22.625599
20:       215                  1     2013-07-04        22.598220
21:       217                  1     2009-12-30        26.683094
22:       222                  1     2007-08-24        20.235455
23:       224                  1     1997-02-14         9.325120
24:       244                  1     1987-04-30         2.754278
25:       251                  0     1986-10-06         1.336071
26:       303                  0     2016-12-31        30.234086
27:       304                  0     1987-02-23         6.028747
28:       307                  0     1997-05-30        13.234771
    person_id scz_failure_status scz_failure_at scz_failure_time
#+end_example

As you can see we got much fewer rows than the previous run, since we discarded anyone born before ~1981-01-01~ and after ~1996-12-31~.

Here's an example of applying all available filters:

#+BEGIN_SRC R :exports both :results output
tte_args <- list(
  samples = list(
    individual_filters = list(
      born_at_min = "1981-01-01",
      born_at_max = "1996-12-31",
      gender = "female",
      status = list(
        "danish-resident",
        "danish-resident-special-address",
        "emigrated",
        "dead"
      )
    ),
    diagnosis_filters = list(
      scz = list(
        icd_codes_regexp = "^F20|^295"
      )
    )
  ),
  study_end_at = "2016-12-31"
)

paths <- tte_retriever$run("scz_millenials", tte_args)

results <- read_csv(paths$data, show_col_types = FALSE, progress = FALSE) |>
  as.data.table()

print(results)
#+END_SRC

#+RESULTS:
:    person_id scz_failure_status scz_failure_at scz_failure_time
: 1:        61                  0     2016-12-31        33.259411
: 2:        94                  1     1997-10-30        13.360712
: 3:       109                  1     1988-10-25         2.179329
: 4:       215                  1     2013-07-04        22.598220
: 5:       224                  1     1997-02-14         9.325120
: 6:       244                  1     1987-04-30         2.754278

* Filtering diagnoses

Besides filtering samples, we can also add extra filters to which diagnoses to include when
determining the failure information of each disorder. Besides the regular expression of the
ICD code, you can also choose which kind of diagnosis to use and which register origin to use.

These are the different kinds of diagnoses:

#+NAME: diagnosis_kinds
#+BEGIN_SRC R :exports results :results output raw
for (kind in epimight:::diagnosis_kinds) {
  cat(sprintf("- ~%s~\n", kind))
}
#+END_SRC

#+RESULTS: diagnosis_kinds
- ~main~
- ~auxiliary~
- ~basic~
- ~referral~
- ~temporary~
- ~complication~
- ~associated~

The diagnosis data comes from two registers. You can choose to only use diagnosis information
from one of them using their unique key:

- ~pcrr~ :: Psychiatric Central Research Register
- ~npr~ :: National Patient Register

If you want to use the diagnosis kinds or register origin filters, you simply add them to
each disorder in ~diagnosis_filters~:

#+BEGIN_SRC R :exports both :results output
tte_args <- list(
  samples = list(
    diagnosis_filters = list(
      scz = list(
        icd_codes_regexp = "^F20|^295",
        diagnosis_kinds = list("main", "auxiliary"),
        record_origin = "pcrr"
      )
    )
  ),
  study_end_at = "2016-12-31"
)

paths <- tte_retriever$run("scz_genpop", tte_args)

results <- read_csv(paths$data, show_col_types = FALSE, progress = FALSE) |>
  as.data.table()

print(results)
#+END_SRC

#+RESULTS:
#+begin_example
     person_id scz_failure_status scz_failure_at scz_failure_time
  1:         1                  1     2001-07-17         12.62697
  2:         2                  0     2016-12-31         34.06434
  3:         4                  0     2016-12-31         66.75975
  4:        10                  0     2016-12-31         47.54552
  5:        14                  0     2016-12-31         86.55989
 ---
136:       309                  0     2016-12-31        104.41615
137:       310                  1     2003-10-19         99.38125
138:       312                  0     2003-11-03         72.71184
139:       314                  0     1986-11-19         50.05339
140:       320                  0     2016-12-31         49.04860
#+end_example

Since you can retrieve diagnosis information for multiple disorders, it allows you to compare
diagnoses from the National Patient Register to the Psychiatric Central Research Register.
For example, if you wanted to compare schizophrenia diagnoses from the two registers, you
could simply add two disorders with different filters:

#+BEGIN_SRC R :exports both :results output
tte_args <- list(
  samples = list(
    diagnosis_filters = list(
      pcrr_scz = list(
        icd_codes_regexp = "^F20|^295",
        record_origin = "pcrr"
      ),
      npr_scz = list(
        icd_codes_regexp = "^F20|^295",
        record_origin = "npr"
      )
    )
  ),
  study_end_at = "2016-12-31"
)

paths <- tte_retriever$run("scz_two_registers", tte_args)

results <- read_csv(paths$data, show_col_types = FALSE, progress = FALSE) |>
  as.data.table()

print(results)
#+END_SRC

#+RESULTS:
#+begin_example
     person_id npr_scz_failure_status npr_scz_failure_at npr_scz_failure_time
  1:         1                      0         2001-12-20             13.05407
  2:         2                      0         2016-12-31             34.06434
  3:         4                      0         2016-12-31             66.75975
  4:        10                      0         2016-12-31             47.54552
  5:        14                      0         2016-12-31             86.55989
 ---
136:       309                      0         2016-12-31            104.41615
137:       310                      0         2016-12-31            112.58316
138:       312                      0         2003-11-03             72.71184
139:       314                      0         1986-11-19             50.05339
140:       320                      0         2016-12-31             49.04860
     pcrr_scz_failure_status pcrr_scz_failure_at pcrr_scz_failure_time
  1:                       1          2001-07-17              12.62697
  2:                       0          2016-12-31              34.06434
  3:                       1          2014-04-19              64.05749
  4:                       1          1995-08-14              26.16290
  5:                       0          2016-12-31              86.55989
 ---
136:                       0          2016-12-31             104.41615
137:                       1          2003-10-19              99.38125
138:                       0          2003-11-03              72.71184
139:                       0          1986-11-19              50.05339
140:                       0          2016-12-31              49.04860
#+end_example

You could even compare diagnoses based on their kind:

#+BEGIN_SRC R :exports both :results output
tte_args <- list(
  samples = list(
    diagnosis_filters = list(
      main_scz = list(
        icd_codes_regexp = "^F20|^295",
        diagnosis_kinds = list("main")
      ),
      auxi_scz = list(
        icd_codes_regexp = "^F20|^295",
        diagnosis_kinds = list("auxiliary")
      )
    )
  ),
  study_end_at = "2016-12-31"
)

paths <- tte_retriever$run("scz_two_kinds", tte_args)

results <- read_csv(paths$data, show_col_types = FALSE, progress = FALSE) |>
  as.data.table()

print(results)
#+END_SRC

#+RESULTS:
#+begin_example
     person_id auxi_scz_failure_status auxi_scz_failure_at auxi_scz_failure_time
  1:         1                       1          2001-07-17              12.62697
  2:         2                       0          2016-12-31              34.06434
  3:         4                       0          2016-12-31              66.75975
  4:        10                       0          2016-12-31              47.54552
  5:        14                       0          2016-12-31              86.55989
 ---
136:       309                       0          2016-12-31             104.41615
137:       310                       1          2003-10-19              99.38125
138:       312                       0          2003-11-03              72.71184
139:       314                       0          1986-11-19              50.05339
140:       320                       0          2016-12-31              49.04860
     main_scz_failure_status main_scz_failure_at main_scz_failure_time
  1:                       0          2001-12-20              13.05407
  2:                       0          2016-12-31              34.06434
  3:                       0          2016-12-31              66.75975
  4:                       0          2016-12-31              47.54552
  5:                       0          2016-12-31              86.55989
 ---
136:                       0          2016-12-31             104.41615
137:                       0          2016-12-31             112.58316
138:                       0          2003-11-03              72.71184
139:                       0          1986-11-19              50.05339
140:                       0          2016-12-31              49.04860
#+end_example

* Adding relatives information

In order to perform heritability and genetic correlation analyses, you need to know the
failure status of relatives for the disorders you are studying. The ~TTERetriever~ allows
you to retrieve this information for one kind of relationship for each run. This means
that you can retrieve diagnosis information for schizophrenia for each sample and then
also count how many full siblings each sample had and how many of those full siblings
was also affected by schizophrenia.

To add the relatives information, you supply the top element ~relatives~ with the
required sub-element ~relationship_filters~ that contain which kind of relationship
to use (in our case "parent offspring"):

#+BEGIN_SRC R :exports both :results output
tte_args <- list(
  samples = list(
    diagnosis_filters = list(
      scz = list(
        icd_codes_regexp = "^F20|^295"
      )
    )
  ),
  relatives = list(
    relationship_filters = list(
      kind = "PO"
    )
  ),
  study_end_at = "2016-12-31"
)

paths <- tte_retriever$run("scz_PO", tte_args)

results <- read_csv(paths$data, show_col_types = FALSE, progress = FALSE) |>
  as.data.table()

print(results)
#+END_SRC

#+RESULTS:
#+begin_example
     person_id scz_failure_status scz_failure_at scz_failure_time relatives
  1:         1                  1     2001-07-17         12.62697         0
  2:         2                  0     2016-12-31         34.06434         0
  3:         4                  1     2014-04-19         64.05749         0
  4:        10                  1     1995-08-14         26.16290         0
  5:        14                  0     2016-12-31         86.55989         0
 ---
136:       309                  0     2016-12-31        104.41615         0
137:       310                  1     2003-10-19         99.38125         0
138:       312                  0     2003-11-03         72.71184         2
139:       314                  0     1986-11-19         50.05339         0
140:       320                  0     2016-12-31         49.04860         0
     scz_affected_relatives
  1:                      0
  2:                      0
  3:                      0
  4:                      0
  5:                      0
 ---
136:                      0
137:                      0
138:                      1
139:                      0
140:                      0
#+end_example

Now we have the regular failure information for each sample, but we also have two extra
columns which counts how many relatives each sample had and how many of those were also affected.

* Using different cohort for relatives

By default, relatives are originates from the same cohort as the samples.
To use instead use a different set of filters on the relatives, you can add a ~individual_filters~
argument inside ~relatives~. For example, if you only want to include mothers when studying
parent/offspring relationships, you simply add:

#+BEGIN_SRC R :exports both :results output
tte_args <- list(
  samples = list(
    diagnosis_filters = list(
      scz = list(
        icd_codes_regexp = "^F20|^295"
      )
    )
  ),
  relatives = list(
    relationship_filters = list(
      kind = "PO"
    ),
    individual_filters = list( #  <---- here are the added filters
      gender = "female"        #
    )                          #
  ),
  study_end_at = "2016-12-31"
)

paths <- tte_retriever$run("scz_PO", tte_args)

results <- read_csv(paths$data, show_col_types = FALSE, progress = FALSE) |>
  as.data.table()

print(results)
#+END_SRC

#+RESULTS:
#+begin_example
     person_id scz_failure_status scz_failure_at scz_failure_time relatives
  1:         1                  1     2001-07-17         12.62697         0
  2:         2                  0     2016-12-31         34.06434         0
  3:         4                  1     2014-04-19         64.05749         0
  4:        10                  1     1995-08-14         26.16290         0
  5:        14                  0     2016-12-31         86.55989         0
 ---
136:       309                  0     2016-12-31        104.41615         0
137:       310                  1     2003-10-19         99.38125         0
138:       312                  0     2003-11-03         72.71184         2
139:       314                  0     1986-11-19         50.05339         0
140:       320                  0     2016-12-31         49.04860         0
     scz_affected_relatives
  1:                      0
  2:                      0
  3:                      0
  4:                      0
  5:                      0
 ---
136:                      0
137:                      0
138:                      1
139:                      0
140:                      0
#+end_example

The same filtering arguments are supported for relatives and samples.

* Using different disorders for relatives

By default, affected relatives will be counted for the same set of disorders as the samples.
To instead use a different set of disorders, you can add a ~diagnosis_filters~ to ~relatives~.
For example, if you want to count how many of the relatives of each sample has schizophrenia
AND bipolar disorder, you simply add:

#+BEGIN_SRC R :exports both :results output
tte_args <- list(
  samples = list(
    diagnosis_filters = list(
      scz = list(
        icd_codes_regexp = "^F20|^295"
      )
    )
  ),
  relatives = list(
    relationship_filters = list(
      kind = "PO"
    ),
    diagnosis_filters = list(           # <--- here are the added diagnosis filters
      scz = list(                       #
        icd_codes_regexp = "^F20|^295"  # We use the same definition for schizophrenia as the samples
      ),                                #
      bpd = list(                       #
        icd_codes_regexp = "^F31"       # But we also include bipolar disorder
      )                                 #
    )                                   #
  ),
  study_end_at = "2016-12-31"
)

paths <- tte_retriever$run("scz_PO", tte_args)

results <- read_csv(paths$data, show_col_types = FALSE, progress = FALSE) |>
  as.data.table()

print(results)
#+END_SRC

#+RESULTS:
#+begin_example
     person_id scz_failure_status scz_failure_at scz_failure_time relatives
  1:         1                  1     2001-07-17         12.62697         0
  2:         2                  0     2016-12-31         34.06434         0
  3:         4                  1     2014-04-19         64.05749         0
  4:        10                  1     1995-08-14         26.16290         0
  5:        14                  0     2016-12-31         86.55989         0
 ---
136:       309                  0     2016-12-31        104.41615         0
137:       310                  1     2003-10-19         99.38125         0
138:       312                  0     2003-11-03         72.71184         2
139:       314                  0     1986-11-19         50.05339         0
140:       320                  0     2016-12-31         49.04860         0
     bpd_affected_relatives scz_affected_relatives
  1:                      0                      0
  2:                      0                      0
  3:                      0                      0
  4:                      0                      0
  5:                      0                      0
 ---
136:                      0                      0
137:                      0                      0
138:                      0                      1
139:                      0                      0
140:                      0                      0
#+end_example

The same filtering arguments are supported for relatives and samples.

* Extra columns

By default the columns that are added to the resulting TTE data file are:

- ~person_id~
- For each disorder:
  - ~[disorder key]_failure_status~
  - ~[disorder key]_failure_at~
  - ~[disorder key]_failure_time~
- If relatives are added:
  - ~relatives~
  - For each disorder:
    - ~[disorder key]_affected_relatives~

Besides those columns, you can also choose to add the following columns:

- ~gender~
- ~born_at~
- ~father_id~
- ~mother_id~
- ~status~
- ~status_changed~
- ~birthplace_id~
- For each disorder:
  - ~[disorder key]_diagnosed_at~
  - ~[disorder key]_diagnosis_kind~
  - ~[disorder key]_diagnosis_icd_edition~
  - ~[disorder key]_diagnosis_icd_id~
  - ~[disorder key]_record_patient_kind~

Here's an example where we request ALL extra columns:

#+BEGIN_SRC R :exports both :results output
tte_args <- list(
  samples = list(
    diagnosis_filters = list(
      scz = list(
        icd_codes_regexp = "^F20|^295"
      )
    )
  ),
  relatives = list(
    relationship_filters = list(
      kind = "PO"
    )
  ),
  study_end_at = "2016-12-31",
  extra_columns = list(
    "gender",
    "born_at",
    "father_id",
    "mother_id",
    "status",
    "status_changed",
    "birthplace_id",
    "scz_diagnosed_at",
    "scz_diagnosis_kind",
    "scz_diagnosis_icd_edition",
    "scz_diagnosis_icd_id",
    "scz_record_patient_kind"
  )
)

paths <- tte_retriever$run("scz_PO", tte_args)

results <- read_csv(paths$data, show_col_types = FALSE, progress = FALSE) |>
  as.data.table()

print(results)
#+END_SRC

#+RESULTS:
#+begin_example
     person_id gender    born_at father_id mother_id                               status
  1:         1 female 1988-11-30        NA        NA                  annulled-cpr-number
  2:         2   male 1982-12-08        NA        NA      danish-resident-special-address
  3:         4 female 1950-03-29        NA        NA greenlandic-resident-special-address
  4:        10   male 1969-06-15         9         8                 greenlandic-resident
  5:        14   male 1930-06-10        NA        NA                      danish-resident
 ---
136:       309 female 1912-08-01        NA        NA                 greenlandic-resident
137:       310   male 1904-06-01        NA        NA                      danish-resident
138:       312 female 1931-02-16       310       309                    unknown-residency
139:       314 female 1936-10-30        NA        NA                    unknown-residency
140:       320   male 1967-12-14       318       317                 greenlandic-resident
     status_changed birthplace_id scz_diagnosed_at scz_diagnosis_kind
  1:     2001-12-20           101       2001-07-17          auxiliary
  2:     1987-05-20          7532             <NA>               <NA>
  3:     1979-04-26          6034       2014-04-19          temporary
  4:     2013-07-14          4650       1995-08-14              basic
  5:     1968-04-27          7524             <NA>               <NA>
 ---
136:     1955-04-08          8087             <NA>               <NA>
137:     1980-09-17          9131       2003-10-19          auxiliary
138:     2003-11-03          2494             <NA>               <NA>
139:     1986-11-19          8098             <NA>               <NA>
140:     2013-10-20          6610       2017-06-30              basic
     scz_diagnosis_icd_edition scz_diagnosis_icd_id  scz_record_patient_kind
  1:                      icd8                29599               outpatient
  2:                      <NA>                   NA                     <NA>
  3:                      icd8                29599               outpatient
  4:                      icd8                29599 outpatient-casualty-ward
  5:                      <NA>                   NA                     <NA>
 ---
136:                      <NA>                   NA                     <NA>
137:                      icd8                29599 outpatient-casualty-ward
138:                      <NA>                   NA                     <NA>
139:                      <NA>                   NA                     <NA>
140:                      icd8                29599       inpatient-full-day
     scz_failure_status scz_failure_at scz_failure_time relatives scz_affected_relatives
  1:                  1     2001-07-17         12.62697         0                      0
  2:                  0     2016-12-31         34.06434         0                      0
  3:                  1     2014-04-19         64.05749         0                      0
  4:                  1     1995-08-14         26.16290         0                      0
  5:                  0     2016-12-31         86.55989         0                      0
 ---
136:                  0     2016-12-31        104.41615         0                      0
137:                  1     2003-10-19         99.38125         0                      0
138:                  0     2003-11-03         72.71184         2                      1
139:                  0     1986-11-19         50.05339         0                      0
140:                  0     2016-12-31         49.04860         0                      0
#+end_example

* Custom individual filters

Sometimes you need to apply complex custom filters for individuals. Using the argument ~custom~
in ~individual_filters~ you can do just that. It accepts a regular string that contains raw SQL WHERE-clause code.
This SQL code is applied to samples that have diagnosis and failure data attached, so you can choose to filter on
the following columns:

- ~sam.id~
- ~sam.gender~
- ~sam.born_at~
- ~sam.father_id~
- ~sam.mother_id~
- ~sam.status~
- ~sam.status_changed~
- ~sam.birthplace_id~
- ~dia.[disorder key]_diagnosed_at~
- ~dia.[disorder key]_diagnosis_kind~
- ~dia.[disorder key]_diagnosis_icd_edition~
- ~dia.[disorder key]_diagnosis_icd_id~
- ~dia.[disorder key]_record_patient_kind~
- ~[disorder key]_fail.failure_status~
- ~[disorder key]_fail.failure_at~
- ~[disorder key]_fail.failure_time~

Note that you need to use the prefixes:

- ~sam~ (as in "samples")
- ~dia~ (as in "diagnosis")
- ~[disorder key]_fail~ (as in "failure")

The reason for this is because there are 3 different tables being joined together, where
each tables have their own alias.

For example, if you use the following arguments:

#+BEGIN_SRC R :exports code
tte_args <- list(
  samples = list(
    diagnosis_filters = list(
      scz = list(
        icd_codes_regexp = "^F20|^295"
      )
    )
  ),
  relatives = list(
    relationship_filters = list(
      kind = "PO"
    )
  ),
  study_end_at = "2016-12-31"
)
#+END_SRC

The part where custom filters are applied, will look like this:

#+BEGIN_SRC sql :exports code
  ) SELECT sam.id as person_id
         , sam.gender
         , sam.born_at
         , sam.father_id
         , sam.mother_id
         , sam.status
         , sam.status_changed
         , sam.birthplace_id
         , dia.scz_diagnosed_at
         , dia.scz_diagnosis_kind
         , dia.scz_diagnosis_icd_edition
         , dia.scz_diagnosis_icd_id
         , dia.scz_record_patient_kind
         , scz_fail.failure_status AS scz_failure_status
         , scz_fail.failure_at     AS scz_failure_at
         , scz_fail.failure_time   AS scz_failure_time
      FROM samples AS sam
           LEFT JOIN final_diagnoses AS dia
                  ON sam.id = dia.person_id

         , epidemiology.determine_failure(
               sam.born_at
             , '2016-12-31'::date
             , dia.scz_diagnosed_at
             , sam.status_changed
             , sam.status
             , array['annulled-cpr-number', 'unknown-residency', 'emigrated']::civil.status[]
             , array['dead']::civil.status[]
           ) AS scz_fail
#+END_SRC

If you wanted to create a custom filter that excluded samples diagnosed with ICD edition 8, you would
change your arguments to include ~custom~ inside ~individual_filters~:

#+BEGIN_SRC R :exports code
tte_args <- list(
  samples = list(
    diagnosis_filters = list(
      scz = list(
        icd_codes_regexp = "^F20|^295"
      )
    ),
    individual_filters = list(                # <--- here's the custom filter
      custom = "dia.scz_icd_edition = 'icd8'" #
    )                                         #
  ),
  relatives = list(
    relationship_filters = list(
      kind = "PO"
    )
  ),
  study_end_at = "2016-12-31"
)
#+END_SRC

That in turn would generate the following SQL code, where you can see that a WHERE-clause has
been added at the end of the diagnosed samples retrieval:

#+BEGIN_SRC sql :exports code
  ) SELECT sam.id as person_id
         , sam.gender
         , sam.born_at
         , sam.father_id
         , sam.mother_id
         , sam.status
         , sam.status_changed
         , sam.birthplace_id
         , dia.scz_diagnosed_at
         , dia.scz_diagnosis_kind
         , dia.scz_diagnosis_icd_edition
         , dia.scz_diagnosis_icd_id
         , dia.scz_record_patient_kind
         , scz_fail.failure_status AS scz_failure_status
         , scz_fail.failure_at     AS scz_failure_at
         , scz_fail.failure_time   AS scz_failure_time
      FROM samples AS sam
           LEFT JOIN final_diagnoses AS dia
                  ON sam.id = dia.person_id

         , epidemiology.determine_failure(
               sam.born_at
             , '2016-12-31'::date
             , dia.scz_diagnosed_at
             , sam.status_changed
             , sam.status
             , array['annulled-cpr-number', 'unknown-residency', 'emigrated']::civil.status[]
             , array['dead']::civil.status[]
           ) AS scz_fail
  -->>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
  -- end of diagnoses for samples
  -->>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

     -- Custom filters on diagnosed samples
     WHERE dia.scz_diagnosis_icd_edition = 'icd8'
#+END_SRC

Note that you need to be careful what you put in ~custom~ since it will be added to the
SQL query directly, without any processing or checking.
